04_tests/reports/performance/raw/interface-comparison-2026-08-28/microservices-list-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-interface-comparison.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * interface_comparison: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 1690 complete and 0 interrupted iterations
interface_comparison   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 3442 complete and 0 interrupted iterations
interface_comparison   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 5097 complete and 0 interrupted iterations
interface_comparison   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 6838 complete and 0 interrupted iterations
interface_comparison   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 8499 complete and 0 interrupted iterations
interface_comparison   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 10237 complete and 0 interrupted iterations
interface_comparison   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 11975 complete and 0 interrupted iterations
interface_comparison   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 13597 complete and 0 interrupted iterations
interface_comparison   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 15263 complete and 0 interrupted iterations
interface_comparison   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 16957 complete and 0 interrupted iterations
interface_comparison   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 18691 complete and 0 interrupted iterations
interface_comparison   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 20431 complete and 0 interrupted iterations
interface_comparison   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 22067 complete and 0 interrupted iterations
interface_comparison   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 23783 complete and 0 interrupted iterations
interface_comparison   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 25439 complete and 0 interrupted iterations
interface_comparison   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 27190 complete and 0 interrupted iterations
interface_comparison   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 28917 complete and 0 interrupted iterations
interface_comparison   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 30512 complete and 0 interrupted iterations
interface_comparison   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 32216 complete and 0 interrupted iterations
interface_comparison   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 33940 complete and 0 interrupted iterations
interface_comparison   [ 100% ] 5 VUs  20.0s/20s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=3.76ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 67894   3394.201562/s
    checks_succeeded...: 100.00% 67894 out of 67894
    checks_failed......: 0.00%   0 out of 67894

    ✓ status is 200
    ✓ response contains fixed dataset

    HTTP
    http_req_duration..............: avg=2.86ms min=1.39ms med=2.74ms max=16.34ms p(90)=3.44ms p(95)=3.76ms
      { expected_response:true }...: avg=2.86ms min=1.39ms med=2.74ms max=16.34ms p(90)=3.44ms p(95)=3.76ms
    http_req_failed................: 0.00%  0 out of 33947
    http_reqs......................: 33947  1697.100781/s

    EXECUTION
    iteration_duration.............: avg=2.94ms min=1.45ms med=2.81ms max=16.42ms p(90)=3.51ms p(95)=3.83ms
    iterations.....................: 33947  1697.100781/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 560 MB 28 MB/s
    data_sent......................: 5.6 MB 279 kB/s



running (20.0s), 0/5 VUs, 33947 complete and 0 interrupted iterations
interface_comparison ✓ [ 100% ] 5 VUs  20s